In [4]:
import pandas as pd

date_string = '2024-01-12'
datetime_obj = pd.to_datetime(date_string)
print(datetime_obj)
print(type(datetime_obj))

2024-01-12 00:00:00
<class 'pandas._libs.tslibs.timestamps.Timestamp'>

- to_datetime

In [5]:
# 문자열, 리스트 각각 형변환시 타입이 다름
date_string = ['2024-01-12']
datetime_obj = pd.to_datetime(date_string)
print(datetime_obj)
print(type(datetime_obj))

DatetimeIndex(['2024-01-12'], dtype='datetime64[ns]', freq=None)
<class 'pandas.core.indexes.datetimes.DatetimeIndex'>

In [6]:
sales = pd.read_csv('../data/raw_sales.csv')
sales.head(3)

              datesold  postcode   price propertyType  bedrooms
0  2007-02-07 00:00:00      2607  525000        house         4
1  2007-02-27 00:00:00      2906  290000        house         3
2  2007-03-07 00:00:00      2905  328000        house         3

In [7]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29580 entries, 0 to 29579
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   datesold      29580 non-null  object
 1   postcode      29580 non-null  int64
 2   price         29580 non-null  int64
 3   propertyType  29580 non-null  object
 4   bedrooms      29580 non-null  int64
dtypes: int64(3), object(2)
memory usage: 1.1+ MB

In [8]:
sales['datesold'] = pd.to_datetime(sales['datesold'])
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29580 entries, 0 to 29579
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   datesold      29580 non-null  datetime64[ns]
 1   postcode      29580 non-null  int64
 2   price         29580 non-null  int64
 3   propertyType  29580 non-null  object
 4   bedrooms      29580 non-null  int64
dtypes: datetime64[ns](1), int64(3), object(1)
memory usage: 1.1+ MB

- datetime으로 형변환시 max(최신 날짜), min(가장 오래된 날짜) 등을 이용한 연산 가능

In [9]:
print(sales['datesold'].max() - sales['datesold'].min())

4553 days 00:00:00

In [10]:
sales['year'] = sales['datesold'].dt.year
sales['month'] = sales['datesold'].dt.month
sales['day'] = sales['datesold'].dt.day

sales.head(3)

    datesold  postcode   price propertyType  bedrooms  year  month  day
0 2007-02-07      2607  525000        house         4  2007      2    7
1 2007-02-27      2906  290000        house         3  2007      2   27
2 2007-03-07      2905  328000        house         3  2007      3    7

- shift()

In [11]:
temp_df = sales.loc[:, ['datesold', 'price']].copy()
temp_df.head()

    datesold   price
0 2007-02-07  525000
1 2007-02-27  290000
2 2007-03-07  328000
3 2007-03-09  380000
4 2007-03-21  310000

In [14]:
temp_df['shifted_v1'] = temp_df['price'].shift(1, fill_value=0).astype(int)
temp_df['shifted_v2'] = temp_df['price'].shift(2, fill_value=0).astype(int)
temp_df['shifted_-1'] = temp_df['price'].shift(-1, fill_value=0).astype(int)
temp_df.tail()

        datesold   price  shifted_v1  shifted_v2  shifted_-1
29575 2019-07-25  500000      475000      380000      560000
29576 2019-07-25  560000      500000      475000      464950
29577 2019-07-26  464950      560000      500000      589000
29578 2019-07-26  589000      464950      560000      775000
29579 2019-07-26  775000      589000      464950           0

In [15]:
temp_df['한글날짜'] = temp_df['datesold'].dt.strftime('%Y년 %m월 %d일')
temp_df.head()

    datesold   price  shifted_v1  shifted_v2  shifted_-1           한글날짜
0 2007-02-07  525000           0           0      290000  2007년 02월 07일
1 2007-02-27  290000      525000           0      328000  2007년 02월 27일
2 2007-03-07  328000      290000      525000      380000  2007년 03월 07일
3 2007-03-09  380000      328000      290000      310000  2007년 03월 09일
4 2007-03-21  310000      380000      328000      465000  2007년 03월 21일

# 예제.

In [16]:
df = pd.read_csv('../data/출동_지연시간.csv')
df.head()

   소방서                 출발시간                 도착시간
0    4  2023-01-01 00:00:00  2023-01-01 00:59:00
1    8  2023-01-01 01:00:00  2023-01-01 02:02:00
2    6  2023-01-01 02:00:00  2023-01-01 03:19:00
3    6  2023-01-01 03:00:00  2023-01-01 04:22:00
4    1  2023-01-01 04:00:00  2023-01-01 05:22:00

In [17]:
df['start'] = pd.to_datetime(df['출발시간'])
df['end'] = pd.to_datetime(df['도착시간'])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   소방서     100 non-null    int64
 1   출발시간    100 non-null    object
 2   도착시간    100 non-null    object
 3   start   100 non-null    datetime64[ns]
 4   end     100 non-null    datetime64[ns]
dtypes: datetime64[ns](2), int64(1), object(2)
memory usage: 4.0+ KB

In [18]:
df['지연시간'] = df['end'] - df['start']
df.head()

,소방서,출발시간,도착시간,start,end,지연시간
0,4,2023-01-01 00:00:00,2023-01-01 00:59:00,2023-01-01 00:00:00,2023-01-01 00:59:00,0 days 00:59:00
1,8,2023-01-01 01:00:00,2023-01-01 02:02:00,2023-01-01 01:00:00,2023-01-01 02:02:00,0 days 01:02:00
2,6,2023-01-01 02:00:00,2023-01-01 03:19:00,2023-01-01 02:00:00,2023-01-01 03:19:00,0 days 01:19:00
3,6,2023-01-01 03:00:00,2023-01-01 04:22:00,2023-01-01 03:00:00,2023-01-01 04:22:00,0 days 01:22:00
4,1,2023-01-01 04:00:00,2023-01-01 05:22:00,2023-01-01 04:00:00,2023-01-01 05:22:00,0 days 01:22:00

In [21]:
# '지연시간'은 timedelta 객체
df['지연시간(분)'] = df['지연시간'].dt.total_seconds() / 60
df.head()

,소방서,출발시간,도착시간,start,end,지연시간,지연시간(분)
0,4,2023-01-01 00:00:00,2023-01-01 00:59:00,2023-01-01 00:00:00,2023-01-01 00:59:00,0 days 00:59:00,59.0
1,8,2023-01-01 01:00:00,2023-01-01 02:02:00,2023-01-01 01:00:00,2023-01-01 02:02:00,0 days 01:02:00,62.0
2,6,2023-01-01 02:00:00,2023-01-01 03:19:00,2023-01-01 02:00:00,2023-01-01 03:19:00,0 days 01:19:00,79.0
3,6,2023-01-01 03:00:00,2023-01-01 04:22:00,2023-01-01 03:00:00,2023-01-01 04:22:00,0 days 01:22:00,82.0
4,1,2023-01-01 04:00:00,2023-01-01 05:22:00,2023-01-01 04:00:00,2023-01-01 05:22:00,0 days 01:22:00,82.0